SPedt_!/src/Documents/УстановкаТарифовПоНаравлениям/УстановкаТарифовПоНаравлениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТарифовПоНаравлениям</name>
  <registerRecords>InformationRegister.ТарифыПоНаправлениям</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тарифы</name>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Откуда</name>
      <type>
        <types>CatalogRef.ГородаСП</types>
        <types>CatalogRef.ТарифнаяГруппа</types>
      </type>
    </attributes>
    <attributes>
      <name>Куда</name>
      <type>
        <types>CatalogRef.ГородаСП</types>
        <types>CatalogRef.ТарифнаяГруппа</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодОтправлен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПолучен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>отправлен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/Documents/УстановкаТарифовПоНаравлениям/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр Тарифы
	ТорифыИзРегистра = ПолучитьТарифыИзРегистра();
	Движения.ТарифыПоНаправлениям.Записывать = Истина;
	Для Каждого ТекСтрокаТарифы Из Тарифы Цикл
		
		массСтрок = ТорифыИзРегистра.НайтиСтроки(Новый Структура("Габарит , Откуда, Куда",ТекСтрокаТарифы.Габарит, ТекСтрокаТарифы.Откуда, ТекСтрокаТарифы.Куда));

		НужноЗаписывать =  (массСтрок.Количество() = 0);
		Если не НужноЗаписывать Тогда
			ТарифИзРегистра = массСтрок[0];
			
			
		НужноЗаписывать =  	(ТарифИзРегистра.Стоимость <>ТекСтрокаТарифы.Стоимость или
			ТекСтрокаТарифы.Отменен);
			
			
		КонецЕсли;
		
		Если НужноЗаписывать Тогда
			Движение 				= Движения.ТарифыПоНаправлениям.Добавить();
			Движение.Период 		= Дата;
			Движение.Габарит 		= ТекСтрокаТарифы.Габарит;
			Движение.Стоимость 		= ТекСтрокаТарифы.Стоимость;
			Движение.Откуда 		= ТекСтрокаТарифы.Откуда;
			Движение.Куда 			= ТекСтрокаТарифы.Куда;
			Движение.Отменен		= ТекСтрокаТарифы.Отменен;
		КонецЕсли;
	КонецЦикла;

	
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	УстановкаТарифовПоНаравлениямТарифы.Габарит КАК Габарит,
	//	|	УстановкаТарифовПоНаравлениямТарифы.Стоимость КАК Стоимость,
	//	|	УстановкаТарифовПоНаравлениямТарифы.Куда КАК Куда,
	//	|	УстановкаТарифовПоНаравлениямТарифы.Откуда КАК Откуда,
	//	|	УстановкаТарифовПоНаравлениямТарифы.Ссылка.Дата КАК Период,
	//	|	УстановкаТарифовПоНаравлениямТарифы.Отменен КАК Отменен
	//	|ИЗ
	//	|	Документ.УстановкаТарифовПоНаравлениям.Тарифы КАК УстановкаТарифовПоНаравлениямТарифы
	//	|ГДЕ
	//	|	УстановкаТарифовПоНаравлениямТарифы.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Движения.ТарифыПоНаправлениям.Записывать = Истина;
	//Движения.ТарифыПоНаправлениям.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры

Процедура ПерезаполнитьДокументПоГородам()
	Если ТипЗнч(Тарифы[0].Откуда) = Тип("СправочникСсылка.ТарифнаяГруппа") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаТарифовПоНаравлениямТарифы.Габарит КАК Габарит,
		|	ТарифнаяГруппаГородаСП.Город КАК Откуда,
		|	ТарифнаяГруппаГородаСП1.Город КАК Куда,
		|	УстановкаТарифовПоНаравлениямТарифы.КодОтправлен КАК КодОтправлен,
		|	УстановкаТарифовПоНаравлениямТарифы.Отменен КАК Отменен,
		|	УстановкаТарифовПоНаравлениямТарифы.Стоимость КАК Стоимость,
		|	УстановкаТарифовПоНаравлениямТарифы.КодПолучен КАК КодПолучен,
		|	УстановкаТарифовПоНаравлениямТарифы.отправлен КАК отправлен,
		|	УстановкаТарифовПоНаравлениямТарифы.СообщениеОшибки КАК СообщениеОшибки
		|ИЗ
		|	Документ.УстановкаТарифовПоНаравлениям.Тарифы КАК УстановкаТарифовПоНаравлениямТарифы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТарифнаяГруппа.ГородаСП КАК ТарифнаяГруппаГородаСП
		|		ПО УстановкаТарифовПоНаравлениямТарифы.Откуда = ТарифнаяГруппаГородаСП.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТарифнаяГруппа.ГородаСП КАК ТарифнаяГруппаГородаСП1
		|		ПО УстановкаТарифовПоНаравлениямТарифы.Куда = ТарифнаяГруппаГородаСП1.Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Тарифы.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//ПерезаполнитьДокументПоГородам();
КонецПроцедуры


Функция ПолучитьТарифыИзРегистра() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТарифыПоНаправлениямСрезПоследних.Габарит КАК Габарит,
		|	ТарифыПоНаправлениямСрезПоследних.Откуда КАК Откуда,
		|	ТарифыПоНаправлениямСрезПоследних.Куда КАК Куда,
		|	ТарифыПоНаправлениямСрезПоследних.Стоимость КАК Стоимость,
		|	ТарифыПоНаправлениямСрезПоследних.Отменен КАК Отменен
		|ИЗ
		|	РегистрСведений.ТарифыПоНаправлениям.СрезПоследних(&НаДату, ) КАК ТарифыПоНаправлениямСрезПоследних
		|ГДЕ
		|	НЕ ТарифыПоНаправлениямСрезПоследних.Отменен";
	
	Если ЗначениеЗаполнено(Дата) Тогда
		НаДату = Новый Граница(Дата,ВидГраницы.Исключая);
	Иначе	
		НаДату = ТекущаяДата();
	КонецЕсли;	
	
	Запрос.Параметры.Вставить("НаДату",НаДату);
	РезультатЗапроса = Запрос.Выполнить();
	
	Тз = РезультатЗапроса.Выгрузить();
	Возврат ТЗ;
КонецФункции

Процедура ЗаполнитьПоРегистру() Экспорт
	ТорифыИзРегистра = ПолучитьТарифыИзРегистра(); 
	Тарифы.Загрузить(ТорифыИзРегистра);
	Для каждого элем из Тарифы Цикл
		Позиция = СтрНайти(элем.Габарит.Код,"-");
		Если Позиция = 0   Тогда
			КодОтправили = Число(Элем.Габарит.Код);
		Иначе	
			КодОтправили = Число(Прав(Элем.Габарит.Код,СтрДлина(Элем.Габарит.Код)-Позиция));
		КонецЕсли;
		элем.КодОтправлен = КодОтправили;
		
	КонецЦикла;
КОнецПроцедуры
